---
kind: property
id: P:Autodesk.Revit.DB.Structure.ConnectionInputPoint.IsValidObject
source: html/226fe8a6-1a0b-40b8-084e-b32a46b1e6e4.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.